app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('ahi esta no se porque no funcaba', 103, '2011-08-23 01:12:44.006586', '2011-08-23 01:12:44.006586')