app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('tester', 'tester@tester.com', '2011-08-20 18:35:44.804151', '2011-08-20 18:35:44.804151', '4696984935bf444ed53c23c921b85cff87057506d6082887f766acf262dfed9a', '89376ff6d6d919566616fc7a33a3e65b11303beb1a48842a79c7840e788f4bad', 'f')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 101)
---
  def show
    @user=User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = 'ced196bc39b454e1b6a43f50942c80c13d660a27456369c802fed65928160ebb', "updated_at" = '2011-08-03 21:26:05.407438' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])